# Movies Tonight Part 4: A few SELECT queries 
__Use `%%sql` magic to write the queries listed below.__

In [11]:
# load %sql magic extension
%reload_ext sql

# initialize a database connection; may have to adjust username and password 
%sql sqlite:///Movies.db

'Connected: @Movies.db'

**1. Write a select query that returns the MovieTitle, TheaterName, and Showtime for each movie showing.**  
The query should use `JOIN` syntax as described in your textbook. Also, use aliases ( `… AS …` ) to make sure that column names match exactly what is asked for.

In [20]:
%%sql
SELECT M.MTitle AS MovieTitle, T.TName AS TheaterName, S.STime AS Showtime
FROM SHOW S
    JOIN MOVIE M ON S.MID = M.MID
    JOIN THEATER T ON S.TID = T.TID

 * sqlite:///Movies.db
(sqlite3.OperationalError) no such table: SHOW [SQL: 'SELECT M.MTitle AS MovieTitle, T.TName AS TheaterName, S.STime AS Showtime\nFROM SHOW S\n    JOIN MOVIE M ON S.MID = M.MID\n    JOIN THEATER T ON S.TID = T.TID'] (Background on this error at: http://sqlalche.me/e/e3q8)

**2. Write a select query to display the MovieTitle, TheaterName, and Showtime for each show after 7pm.** You can start with a copy of the previous query and then add a `WHERE` clause.

In [21]:
%%sql
SELECT M.MTitle AS MovieTitle, T.TName AS TheaterName, S.STime AS Showtime
FROM SHOW S
    JOIN MOVIE M ON S.MID = M.MID
    JOIN THEATER T ON S.TID = T.TID
WHERE S.STime > 7

 * sqlite:///Movies.db
(sqlite3.OperationalError) no such table: SHOW [SQL: 'SELECT M.MTitle AS MovieTitle, T.TName AS TheaterName, S.STime AS Showtime\nFROM SHOW S\n    JOIN MOVIE M ON S.MID = M.MID\n    JOIN THEATER T ON S.TID = T.TID\nWHERE S.STime > 7'] (Background on this error at: http://sqlalche.me/e/e3q8)

**3. Write a select query to display the cast (actors only) of each movie.** The query should return the Movie Title, Actor Name, MID, and AID.

In [22]:
%%sql
SELECT M.MTitle AS Movie Title, A.AID AS Actor Name, M.MID AS MID, A.AID AS AID
FROM CREDIT C
    JOIN MOVIE M ON C.MID = M.MID
    JOIN ARTIST A ON C.AID = A.AID

 * sqlite:///Movies.db
(sqlite3.OperationalError) near "Title": syntax error [SQL: 'SELECT M.MTitle AS Movie Title, A.AID AS Actor Name, M.MID AS MID, A.AID AS AID\nFROM CREDIT C\n    JOIN MOVIE M ON C.MID = M.MID\n    JOIN ARTIST A ON C.AID = A.AID'] (Background on this error at: http://sqlalche.me/e/e3q8)

**4. Write a select query to display the number of distinct movies that each actor appears in.** The query should return the ActorName, MovieCount, and AID. You will need to use use a GROUP BY clause and the COUNT() function.

In [23]:
%%sql
SELECT A.AName AS Actor Name, COUNT(DISTINCT M.MID), A.AID AS AID
FROM MOVIE M
    JOIN MOVIE M ON C.MID = M.MID
    JOIN ARTIST A ON C.AID = A.AID
GROUP BY A.AID

 * sqlite:///Movies.db
(sqlite3.OperationalError) near "Name": syntax error [SQL: 'SELECT A.AName AS Actor Name, COUNT(DISTINCT M.MID), A.AID AS AID\nFROM MOVIE M\n    JOIN MOVIE M ON C.MID = M.MID\n    JOIN ARTIST A ON C.AID = A.AID\nGROUP BY A.AID'] (Background on this error at: http://sqlalche.me/e/e3q8)

**5. Write a select query to display only the actors that appear in multiple movies.** The query should return the Actor Name, Movie Count, and AID. You can use the previous select query as a starting point. You will need to add a HAVING clause to do the restriction.

In [24]:
%%sql
SELECT A.AName AS Actor Name, COUNT(DISTINCT M.MID), A.AID AS AID
FROM MOVIE M
    JOIN MOVIE M ON C.MID = M.MID
    JOIN ARTIST A ON C.AID = A.AID
GROUP BY A.AID HAVING COUNT(DISTINCT M.MID)

 * sqlite:///Movies.db
(sqlite3.OperationalError) near "Name": syntax error [SQL: 'SELECT A.AName AS Actor Name, COUNT(DISTINCT M.MID), A.AID AS AID\nFROM MOVIE M\n    JOIN MOVIE M ON C.MID = M.MID\n    JOIN ARTIST A ON C.AID = A.AID\nGROUP BY A.AID HAVING COUNT(DISTINCT M.MID)'] (Background on this error at: http://sqlalche.me/e/e3q8)

**6. Write a select query to display directors that also act in their movies.** The query should return the ArtistName, NumDirectorCredits, NumActorCredits, NumDirectorActorCredits. Each count should be calculated separately using a subquery. Note: NumDirectorActorCredits should be greater than 0.